#Handling Missing value Use Scikit Learn

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv(r"E:/MY PROGRAMMING JOURNEY/CSV FILE/clv_data.csv")
df.head(5)

,Unnamed: 0,id,age,gender,income,days_on_platform,city,purchases,Unnamed: 8
0,0.0,0.0,NaN,Male,126895.0,14.0,San Francisco,0.0,NaN
1,1.0,1.0,NaN,Male,161474.0,14.0,Tokyo,0.0,NaN
2,2.0,2.0,24.0,Male,104723.0,34.0,London,1.0,NaN
3,3.0,3.0,29.0,Male,43791.0,28.0,London,2.0,NaN
4,4.0,4.0,18.0,Female,132181.0,26.0,London,2.0,NaN

In [4]:
# check the null value
df.isnull().sum()

Unnamed: 0            15
id                     8
age                 2448
gender                37
income                17
days_on_platform     144
city                  14
purchases              3
Unnamed: 8          4999
dtype: int64

In [5]:
#find which type of datatype are present in the given data  set
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        4985 non-null   float64
 1   id                4992 non-null   float64
 2   age               2552 non-null   float64
 3   gender            4963 non-null   object
 4   income            4983 non-null   float64
 5   days_on_platform  4856 non-null   float64
 6   city              4986 non-null   object
 7   purchases         4997 non-null   float64
 8   Unnamed: 8        1 non-null      float64
dtypes: float64(7), object(2)
memory usage: 351.7+ KB

In [7]:
#Find the columns name which have float value
df.select_dtypes(include="float64").columns

Index(['Unnamed: 0', 'id', 'age', 'income', 'days_on_platform', 'purchases',
       'Unnamed: 8'],
      dtype='object')

In [8]:
#fill the missing value using scikit learn
#import scikit learn library
from sklearn.impute import SimpleImputer

In [12]:
#call the simpleImputer 
si=SimpleImputer(strategy="mean")
ar=si.fit_transform(df[['Unnamed: 0', 'id', 'age', 'income', 'days_on_platform', 'purchases',
       'Unnamed: 8']])
#ar is a variable

In [13]:
pd.DataFrame(ar,columns=df.select_dtypes(include="float64").columns)

,Unnamed: 0,id,age,income,days_on_platform,purchases,Unnamed: 8
0,0.0,0.0,30.208072,126895.0,14.0,0.0,0.0
1,1.0,1.0,30.208072,161474.0,14.0,0.0,0.0
2,2.0,2.0,24.000000,104723.0,34.0,1.0,0.0
3,3.0,3.0,29.000000,43791.0,28.0,2.0,0.0
4,4.0,4.0,18.000000,132181.0,26.0,2.0,0.0
...,...,...,...,...,...,...,...
4995,4995.0,4995.0,30.208072,212261.0,28.0,1.0,0.0
4996,4996.0,4996.0,30.208072,70228.0,12.0,0.0,0.0
4997,4997.0,4997.0,30.208072,64995.0,14.0,0.0,0.0
4998,4998.0,4998.0,30.208072,56144.0,4.0,2.0,0.0
4999,4999.0,4999.0,30.208072,110977.0,29.0,0.0,0.0

In [15]:
#store the new data set 
newData=pd.DataFrame(ar,columns=df.select_dtypes(include="float64").columns)

#Check the missing value are present in new data set 
newData.isnull().sum()

Unnamed: 0          0
id                  0
age                 0
income              0
days_on_platform    0
purchases           0
Unnamed: 8          0
dtype: int64